helpers/AppHelpers.php

    public static function getBlogCategories() {

        $model = BlogCategories::findAll(['is_deleted' => 0, 'is_active' => 1]);
---
SELECT * FROM `tbl_blog_categories` WHERE (`is_deleted`=0) AND (`is_active`=1)

    public static function getPopularBlog($limit = 3) {

        /* @var $model Blogs[] */
        $model = Blogs::find()
            ->where(['is_deleted' => 0, 'is_active' => 1, 'is_featured' => 1])
            ->limit($limit)
            ->all();
---
SELECT * FROM `tbl_blogs` WHERE (`is_deleted`=0) AND (`is_active`=1) AND (`is_featured`=1) LIMIT 3

    public static function getTestimonies() {

        return Testimonies::findAll(['is_deleted' => 0, 'is_active' => 1]);
---
SELECT * FROM `tbl_testimonies` WHERE (`is_deleted`=0) AND (`is_active`=1)

    public static function getFeaturedDoctors() {

        return Doctors::findAll(['is_deleted' => 0, 'is_active' => 1, 'is_featured' => 1]);
---
SELECT * FROM `tbl_doctors` WHERE (`is_deleted`=0) AND (`is_active`=1) AND (`is_featured`=1)

    public static function getPagesMenu() {

        return Pages::find()
            ->where(['show_in_menu' => 1])
            ->orderBy(['sort_order' => SORT_ASC])
            ->all();
---
SELECT * FROM `tbl_pages` WHERE `show_in_menu`=1 ORDER BY `sort_order`